[
    {
        "id": 1,
        "niveau": 3,
        "categorie": "manuelle",
        "nom" :"Choisir et configurer son matériel",
        "description" : ""
    },
    {
        "id": 2,
        "niveau": 2,
        "categorie": "manuelle",
        "nom" :"Configurer le BIOS/UEFI",
        "description" : ""
    },
    {
        "id": 3,
        "niveau": 2,
        "categorie": "manuelle",
        "nom" :"Activer le Secure Boot",
        "description" : ""
    },
    {
        "id": 4,
        "niveau": 2,
        "categorie": "manuelle",
        "nom" :"Remplacer les clés préchargées",
        "description" : ""
    },
    {
        "id": 5,
        "niveau": 2,
        "categorie": "manuelle",
        "nom" :"Configurer un mot de passe pour le chargeur de démarrage",
        "description" : ""
    },
    {
        "id": 6,
        "niveau": 2,
        "categorie": "manuelle",
        "nom" :"Protéger les paramètres du cmd noyau et l'initramfs",
        "description" : ""
    },
    {
        "id": 7,
        "niveau": 3,
        "categorie": "automatisée",
        "nom" :"Activer l'IOMMU",
        "description" : "L'OMMU (Input/Output Memory Management Unit) est un service permettant de protéger la mémoire du systèmes vis-a-vis d'accès non souhaité par des périphériques. Sa conception est imparfaite et son efficacité dépend du système hôte mais il permet de limiter les risques d'accès mémoire non souhaité."
    },
    {
        "id": 8.1,
        "niveau": 2,
        "nom": "activer les contremesures l1tf",
        "categorie": "automatisée",
        "description": "Enormément de processeurs intels présentent la faille L1TF (L1 Terminal Fault) qui permet à un attaquant d'accéder au contenu du cache L1 du processeur.",
        "impact_performances": "Cette option désactive le symetric multithreading, ce qui baisse beaucoup les performances du système."
    },
    {
        "id": 8.2,
        "niveau": 2,
        "nom": "activer les contremesures page poisonning",
        "categorie":"automatisée",
        "description": "Cette option activr l'empoisonnement des pages de l'allocateur. Lorsqu'une page de RAM est libérée, le kernel rajoute des motifs et les revérifie lors de la prochaine allocation. Cette vérification permet de lutter contre les fuites d'informations"
    },
    {
        "id": 8.3,
        "niveau": 2,
        "nom": "Forcer l'utilisation de l'isolation des tables de pages",
        "categorie":"automatisée",
        "description": "L'isolation des tables de pages est une contremesure mise en place pour lutter contre la faille meltdown, qui exploite l'éxecution spéculative des processeurs post 1995"
    },
    {
        "id": 8.4,
        "niveau": 2,
        "nom": "desactiver la fusion de la mémoire dynamique",
        "description": "Par défaut, les les tables de mémoire de même taille sont autorisées à fusionner. Cette possibilité expose à la faille heap overflow",
        "categorie":"automatisée"
    },
    {
        "id": 8.5,
        "niveau": 2,
        "categorie":"automatisée",
        "nom": "Actver le renforcement de la mémoire dynamique",
        "description": "Dans la continuité de la recommandation 8.4, il est important d'activer les tests de cohérence des métadonnées, l'ajout de la zone rouge sur chaque objet et le poisonning des objets et du padding"
    },
    {
        "id": 8.6,
        "niveau": 2,
        "categorie":"automatisée",
        "nom": "Activer les contremesures spectre V4 (speculative store bypass)",
        "description": "De nombreux processeurs intels disposent d'un défaut dans leur architecture permettant l'exploitation de la faille spectre V2, qui utilise l'execution spéculative à de mauvaises fins"
    },
    {
        "id": 8.7,
        "niveau":2,
        "categorie":"automatisée",
        "nom":"Activer les contremesures spectre V2 (branch target injection)",
        "description": "De nombreux processeurs intels disposent d'un défaut dans leur architecture permettant l'exploitation de la faille spectre V2, qui utilise l'execution spéculative à de mauvaises fins"
    },
    {
        "id": 8.8,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Force l'utilisation du microarchitectural data sampling",
        "description": "Le MDS est une contremesure vis-a-vis de plusieurs failles dans l'architecture des processeurs intel",
        "impact_performances":"Cette recommandation est similaire à la 8.1, en terme de risque de perte de performances"
    },
    {
        "id": 8.9,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Désactiver les Machine Check Exceptions (MCE)",
        "description": "Désactiver les MCE revient à générér un kernel panic dès qu'une erreur non corrigée est detectée par le machine check. Par défaut, un simple signal d'anomalie SIGBUS est envoyé. Cette configuration bloque donc les processus malveillants dans de nombreux cas"
    },
    {
        "id": 8.10,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Activer la Page Allocator Randomization",
        "description": "La Page Allocator Randomization rend l'allocation des pages moins prévisibles, ce qui limite le prélèvement de données",
        "impact_performances": "Les machines avec pas ou peu de cache sont susceptibles de voir leurs performances baisser"
    },
    {
        "id": 8.11,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Fixer le HWRNG à 500",
        "description": "Cette opération a pour effet d'augmenter la confiance dans le générateur de nombre pseudos-aléatoires. Les performances  du système et des outils cryptographiques s'en voient augmentées"
    },
    {
        "id": 9.1,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Restreindre le buffer dmesg",
        "description": "Le buffer dmesg contient les messages directement émis par le kernel. Son accès doit être restreint car il donne beaucoup d'information sur le fonctionnement du système visé"
    },
    {
        "id": 9.2,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Restreindre l'accès aux adresses noyau",
        "description": "Certaines interfaces comme /proc permettent de voir les adresses noyaux des processus. Ici, plus aucun programme n'aura accès à cet information"
    },
    {
        "id": 9.3,
        "niveau":2,
        "categorie": "manuelle", 
        "nom" : "Définir le nombre maximum de processus du système",
        "description": "Cette recommandation est parfaitement oubliable car il est très difficile de définir un nombre pertinent qui accroit la sécurité sans pour autant impacter les performances"
    },
    {
        "id": 9.4,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Limiter l'utilisation du sous-système perf",
        "description": "Le sous-système perf est utilisé par linux pour surveiller les métriques de la machine. Ici, on limite sa consommation de ressources et les utilisateurs"
    },
    {
        "id": 9.5,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Désactiver le kernel profiling",
        "description": "Le kernel profiling permet de voir en temps réél les performances du noyau dans le but de les optimiser. Seuls les utilisateurs avec la capability CAP_SYS_ADMIN gardent l'accès"
    },
    {
        "id": 9.6,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Activer l'ASLR",
        "description": "L'ASLR (Address Space Layout Randomizer) rend aléatoire les adresses mémoire des processus pour rendre plus difficile l'exploitation de failles mémoire"
    },
    {
        "id": 9.7,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Désactiver les combinaisons de touches magiques",
        "description": "Les combinaisons de touches magiques sont une combinaisons de saisies clavier permettant d'envoyer des instruction directement dans le kernel, même en cas de freeze"
    },
    {
        "id": 9.8,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "restreindre le BPF",
        "description": "Le BPF (Berkeley Packet Filter) est un ensemble de programmes déclenchés via des fonctions noyau ou des appels système"
    },
    {
        "id": 9.9,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Activer le kernel panic on oops",
        "description": "Cette option provoque un kernel panic dès qu'un comportement inatendu est detecté"
    },
    {
        "id": 10,
        "niveau": 3,
        "categorie": "automatisée", 
        "nom" : "Désactiver les chargement de modules noyau",
        "description": "A noter que même si cette option est activée, il est possible de répertorier des modules qui seront quand même chargés dans /etc/modules/ ou /etc/modules-load.d/"
    },
    {
        "id": 11,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Activer Yama",
        "description": "Yama est un LSM (Linux Security Module) très puissant et standard"
    },
    {
        "id": 12.1,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Limiter la dispertion du JIT",
        "description": "le JIT (Just In Time) est un élément du système lié à plusieurs faimmes de sécurité",
        "impact_performances": "Les performances de la machine peuvent baisser avec cette option"
    },
    {
        "id": 12.2,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Désactiver le routage des interfaces",
        "description": "Yama est un LSM (Linux Security Module) très puissant et standard"
    },
    {
        "id": 12.3,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Désactiver l'accès local depuis l'extérieur",
        "description": "Cette option empêche la connextion à un service ayant comme source 127.0.0.0/8"
    },
    {
        "id": 12.4,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Désactiver le traitement de paquets de type ICMP redirect",
        "description": "Les paquets de type ICMP redirect sont utilisées dans des attaques visant à intercepter le trafic réseau d'une machine"
    },
    {
        "id": 12.5,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Retirer la prise en compte des paquets source-routed",
        "description": "Les paquets source-routed permettent à l'expéditeur de spécifier le chemin que le paquet doit prendre à travers le réseau"
    },
    {
        "id": 12.6,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Désactiver la gestion de la table ARP",
        "description": "Cette option interdit de répondre à une interface X avec les informations d'une autre interface Y"
    },
    {
        "id": 12.8,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Désactiver le routage de paquets provenant de la boucle locale",
        "description": "Tous les paquets de 127.0.0.0/8 ne seront pas émis sur une interface réseau"
    },
    {
        "id": 12.9,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Désactiver le traitement des sollicitations de type gratuitous ARP",
        "description": "Cette option permet de se prémunir contre les attaques de type arp poisoning mais ne marche que si plusieurs proxys ARP sont en fonctionnement",
        "impact_performances": "Cette option ne doit pas être activée dans un contexte de haute disponibilité"
    },
    {
        "id": 12.10,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Activer la double vérification de paquets entrants et sortants",
        "description": "Une vérification est fait sur l'interface d'arrivée et de retour"
    },
    {
        "id": 12.11,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Bloquer l'envoi des paquets ICMP redirect",
        "description": "La valeur peut rester à 1 dans le cadre d'un routeur. Un equipement terminal n'a pas de raison de recevoir un flux dont il n'est pas destinataire"
    },
    {
        "id": 12.12,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Activer la norme RFC 1122",
        "description": "La norme RFC 1122 est la norme standardisant le format des paquets reçus et envoyés par la machine"
    },
    {
        "id": 12.13,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Activer la norme RFC 1337",
        "description": "La norme RFC 1337 permet de lutter contre les attaques de type TIME_WAIT assassination, qui consiste à provoquer des erreurs pas superposition de segments et desynchronisation des flux"
    },
    {
        "id": 12.14,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Activer l'utilisation des SYN cookies",
        "description": "Les SYN cookies permettent de lutter contre les attaques de type SYN flood. Ce sont un choix de numéros de séquence initial lors d'une demande de connexion TCP. Les requêtes semi-ouvertes voient leur état sauvegarder dans le numéro de séquence initial"
    },
    {
        "id": 13,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Désactiver le plan ipv6",
        "description": "Si le plan ipv6 ne sert pas, autant le désactiver"
    },
    {
        "id": 14.1,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Désactiver les coredumps pour setuid",
        "description": "il est possible de rajouter CONFIG_COREDUMP=n pour désactiver tous les coredumps"
    },
    {
        "id": 14.2,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Interdire l'ouverture des fichiers FIFO et des fichiers qui n'appartiennent pas à l'utilisateur initial",
        "description": "Les fichiers FIFO sont utilisées pour la communication entre processus. Ils peuvent être utilisés par des attaquants pour intercepter des données sensibles"
    },
    {
        "id": 14.3,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Restreindre la creation de liens symboliques aux fichiers dont l'utilisateur est propriétaire",
        "description": "Cette restriction sert à lutter contre les failles time on check / time on use"
    },
    {
        "id": 14.4,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Restreindre la creation de liens durs aux fichiers dont l'utilisateur est propriétaire",
        "description": "Ici, on restreint les coredumps aux seuls utilisateurs avec la capability CAP_SYS_ADMIN"
    },
    {
        "id": 28,
        "niveau": 2,
        "categorie": "manuelle", 
        "nom" : "respecter le partitionnement standard",
        "description": "Les mountpoints suivants doivent être présents: / /boot /opt /tmp /srv /home /proc /var /var/log /var/tmp"
    },
    {
        "id": 29,
        "niveau": 3,
        "categorie": "automatisée", 
        "nom" : "Restreindre l'accès au dossier /boot",
        "description": "seul root doit avoir accès au dossier /boot pour des raisons de sécurité"
    },
    {
        "id": 30,
        "niveau": 1,
        "categorie": "manuelle", 
        "nom" : "Désactiver les compte utilisateurs inutilisés",
        "description": "Les mountpoints suivants doivent être présents: / /boot /opt /tmp /srv /home /proc /var /var/log /var/tmp"
    },
    {
        "id": 31,
        "niveau": 1,
        "categorie": "manuelle", 
        "nom" : "Utiliser des mots de passe forts",
        "description": "Les mots de passe doivent avoir une longueur minimale de 12 caractères et contenir des majuscules, des minuscules, des chiffres et des caractères spéciaux."
    },
    {
        "id": 32,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Expirer les sessions utilisateurs locales",
        "description": "Il faut ajouter TMOUT=N avec N le nombre de secondes d'inactivité avant expiration dans le bashrc"
    },
    {
        "id": 33,
        "niveau": 2,
        "categorie": "manuelle", 
        "nom" : "Assurer l'imputabilité des actions d'administration",
        "description": "chaque admin doit avoir un ou plusieurs comptes nominatifs dédiés (local ou distant) et ne jamais utiliser le compte root. Les secrets d'authentification doivent être différents. Le compte root doit être désactivé"
    },
    {
        "id": 34,
        "niveau": 2,
        "categorie": "manuelle", 
        "nom" : "Les comptes de services doivent être désactivés",
        "description": "Les comptes de service ne doivent pas permettre de connexion interactive"
    },
    {
        "id": 35,
        "niveau": 2,
        "categorie": "manuelle", 
        "nom" : "Utiliser des comptes de service dédiés",
        "description": "Chaque service métier doit avoir son propre compte système dédié."
    },
    {
        "id": 36,
        "niveau": 3,
        "categorie": "manuelle", 
        "nom" : "Modifier la valeur de umask par défaut",
        "description": "La valeur à mettre en place est 0077. Umask est la valeur par défaut de la création de nouveaux fichiers sur la machine"
    },
    {
        "id": 37,
        "niveau": 3,
        "categorie": "manuelle", 
        "nom" : "Utiliser les fonctionnalités de contrôle d'accès obligatoire (MAC)",
        "description": "Les DAC (Discretionary Access Control) sont le mode de fonctionnement basique de linux. Le MAC (Mandatory Access Control) est un aujout au DAC avec un meilleur cloisonnement et une meilleure sécurité. Pour se faire, on peut utiliser SELinux"
    },
    {
        "id": 38,
        "niveau": 3,
        "categorie": "automatisée", 
        "nom" : "Créer un groupe dédié à l'utilisation de sudo",
        "description": "A noter qu'en cas de mise à jour du paquet sudo, cette configuration a des chances de sauter. Il faut donc penser à vérifier après chaque mise à jour"
    },
    {
        "id": 39,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "modifier les directivers de configuration sudo",
        "description": "Les mots de passe doivent avoir une longueur minimale de 12 caractères et contenir des majuscules, des minuscules, des chiffres et des caractères spéciaux."
    },
    {
        "id": 40,
        "niveau": 2,
        "categorie": "manuelle", 
        "nom" : "Utiliser des utilisateurs non privilégiés pour les commandes sudo",
        "description": "Les utilisateurs cibles doivent autant que possible être des utilisateurs non privilégiés"
    },
    {
        "id": 41,
        "niveau": 3,
        "categorie": "manuelle", 
        "nom" : "Limiter l'utilisation des commandes nécessitant la directive EXEC",
        "description":"Les commandes nécessitant l'éxecution d'un sous-processus EXEC doivent être listées et réduites au maximum"
    },
    {
        "id": 42,
        "niveau": 2,
        "categorie": "manuelle", 
        "nom" : "Bannir les négations dans les spécifications de commandes sudo",
        "description": "L'utilisation de la négation '!' dans les spécifications de commandes sudo peut introduire des failles de sécurité en permettant des contournements inattendus."
    },
    {
        "id": 43,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "modifier les directivers de configuration sudo",
        "description": "Les mots de passe doivent avoir une longueur minimale de 12 caractères et contenir des majuscules, des minuscules, des chiffres et des caractères spéciaux."
    },
    {
        "id": 44,
        "niveau": 2,
        "categorie": "manuelle", 
        "nom" : "Editer les fichiers de manière sécurisée avec sudo",
        "description": "La modification d'un fichier texte avec sudo doit se faire via la commande sudoedit afin d'éviter l'execution de programmes malveillants"
    },
    {
        "id": 45,
        "niveau": 3,
        "categorie": "automatisée", 
        "nom" : "les profils de sécurité AppArmor doivent être en mode enforcing par défaut",
        "description": "la commande aa-status permet de vérifier le mode des profils AppArmor"
    },
    {
        "id": 46,
        "niveau": 4,
        "categorie": "automatisée", 
        "nom" : "Activer la politique SELinux avec la politique targeted",
        "description": "Les mots de passe doivent avoir une longueur minimale de 12 caractères et contenir des majuscules, des minuscules, des chiffres et des caractères spéciaux."
    },
    {
        "id": 47,
        "niveau": 4,
        "categorie": "manuelle", 
        "nom" : "Confiner les utilisateurs interactifs avec SELinux",
        "description": "Les utilisateurs interactifs doivent être confinés dans des domaines SELinux restreints pour limiter leur accès aux ressources système."
    },
    {
        "id": 48,
        "niveau": 4,
        "categorie": "manuelle", 
        "nom" : "Paramétrer les variables SELinux",
        "description": "Les processus ne doivent pas pouvoir rendre leur heap executable, ni avoir de zone mémoire en écriture ou en éxecution, ni rendre leur stack executable, ni pouvoir appliquer de changement dynamique sur les modules. Le role sysadmin ne doit pas être accessible via ssh"
    },
    {
        "id": 49,
        "niveau": 4,
        "categorie": "manuelle", 
        "nom" : "Installer des outils de deboguage SELinux",
        "description": "Utiliser les services setroubleshootd et les paquets setroubleshoot, setroubleshoot-server et setroubleshoot-plugins"
    },
    {
        "id": 50,
        "niveau": 2,
        "categorie": "manuelle", 
        "nom" : "Restreindre les droits d'accès aux fichiers et répertoires sensibles",
        "description": "Les fichiers ou répertoires sensibles doivent avoir root en propriétaire. Si un utilisateur doit avoir accès aux fichiers, ce dernier doit en être le propriétaire et être dans un groupe dédié qui aura un accès en lecture seule. Le reste des utilisateurs ne doit avoir aucun droit"
    },
    {
        "id": 51,
        "niveau": 3,
        "categorie": "manuelle", 
        "nom" : "Changer les secrets et droit d'accès à l'installation",
        "description": "Tous les fichiers sensibles du système ou secret lié à l'authentification doit être changé dès l'installation"
    },
    {
        "id": 52,
        "niveau": 2,
        "categorie": "manuelle", 
        "nom" : "Restreindre les accès aux sockets et aux pipes nommés",
        "description": ""
    },
    {
        "id": 53,
        "niveau": 1,
        "categorie": "automatisée", 
        "nom" : "Eviter les fichiers ou répertoires sans utilisateur ou sans groupe connu",
        "description": "Ces fichiers doivent se trouver un propriétaire ou être supprimés"
    },
    {
        "id": 54,
        "niveau": 1,
        "categorie": "automatisée", 
        "nom" : "Activer le sticky bit sur les répertoires inscriptible",
        "description": "Le répertoire /proc n'est pas concerné par cette recommandation car les fichiers sont constamment supprimés et recréés"
    },
    {
        "id": 55,
        "niveau": 2,
        "categorie": "manuelle", 
        "nom" : "Séparer les répertoires temporaires des utilisateurs",
        "description": "Chaque utilisateur doit posséder son propre répertoire temporaire et en disposer exclusivement."
    },
    {
        "id": 56,
        "niveau": 1,
        "categorie": "automatisée", 
        "nom" : "Eviter l'usage d'éxecutables avec des droits spéciaux setiud et setgid",
        "description": "Seuls des logiciels de confiance venant de distributeurs de paquets peuvent avoir des droit spéciaux"
    },
    {
        "id": 57,
        "niveau": 3,
        "categorie": "manuelle", 
        "nom" : "Eviter l'usage d'éxecutables avec des droits spéciaux setiud root et setgid root",
        "description": "Cette recommandation est difficile à instaurer car des droits spéciaux peuvent être réinstaurés après chaque mise à jour"
    },
    {
        "id": 58,
        "niveau": 1,
        "categorie": "manuelle", 
        "nom" : "N'installer que les paquets strictement nécessaires",
        "description": "Tous les paquets doivent se voir justifiés ou être désinstallés"
    },
    {
        "id": 59,
        "niveau": 1,
        "categorie": "manuelle", 
        "nom" : "Utiliser des dépots de confiance",
        "description": "Sauf exception, seuls les dépots de l'entreprise ou de la distribution linux sont autorisés"
    },
    {
        "id": 60,
        "niveau": 3,
        "categorie": "manuelle", 
        "nom" : "Utiliser des dépôts de paquets durcis",
        "description": "Si la distribution propose des dépôts de paquets durcis, il est recommandé de les utiliser, car ces dernies appliquent des contraintes de sécurité plus importantes"
    },
    {
        "id": 61,
        "niveau": 1,
        "categorie": "manuelle", 
        "nom" : "Effectuer des mises à jour régulières",
        "description": "Pour cela il est recommandé de mettre en place un flux RSS et de faire s'abonner les responsables infra au flux CERT FR"
    }
]