[
    {
        "id": 1,
        "niveau": 3,
        "categorie": "manuelle",
        "nom" :"Choisir et configurer son matériel",
        "description" : ""
    },
    {
        "id": 2,
        "niveau": 2,
        "categorie": "manuelle",
        "nom" :"Configurer le BIOS/UEFI",
        "description" : ""
    },
    {
        "id": 3,
        "niveau": 2,
        "categorie": "manuelle",
        "nom" :"Activer le Secure Boot",
        "description" : ""
    },
    {
        "id": 4,
        "niveau": 2,
        "categorie": "manuelle",
        "nom" :"Remplacer les clés préchargées",
        "description" : ""
    },
    {
        "id": 5,
        "niveau": 2,
        "categorie": "manuelle",
        "nom" :"Configurer un mot de passe pour le chargeur de démarrage",
        "description" : ""
    },
    {
        "id": 6,
        "niveau": 2,
        "categorie": "manuelle",
        "nom" :"Protéger les paramètres du cmd noyau et l'initramfs",
        "description" : ""
    },
    {
        "id": 7,
        "niveau": 3,
        "categorie": "automatisée",
        "nom" :"Activer l'IOMMU",
        "description" : "L'OMMU (Input/Output Memory Management Unit) est un service permettant de protéger la mémoire du systèmes vis-a-vis d'accès non souhaité par des périphériques. Sa conception est imparfaite et son efficacité dépend du système hôte mais il permet de limiter les risques d'accès mémoire non souhaité."
    },
    {
        "id": 8.1,
        "niveau": 2,
        "nom": "activer les contremesures l1tf",
        "categorie": "automatisée",
        "description": "Enormément de processeurs intels présentent la faille L1TF (L1 Terminal Fault) qui permet à un attaquant d'accéder au contenu du cache L1 du processeur.",
        "impact_performances": "Cette option désactive le symetric multithreading, ce qui baisse beaucoup les performances du système."
    },
    {
        "id": 8.2,
        "niveau": 2,
        "nom": "activer les contremesures page poisonning",
        "categorie":"automatisée",
        "description": "Cette option activr l'empoisonnement des pages de l'allocateur. Lorsqu'une page de RAM est libérée, le kernel rajoute des motifs et les revérifie lors de la prochaine allocation. Cette vérification permet de lutter contre les fuites d'informations"
    },
    {
        "id": 8.3,
        "niveau": 2,
        "nom": "Forcer l'utilisation de l'isolation des tables de pages",
        "categorie":"automatisée",
        "description": "L'isolation des tables de pages est une contremesure mise en place pour lutter contre la faille meltdown, qui exploite l'éxecution spéculative des processeurs post 1995"
    },
    {
        "id": 8.4,
        "niveau": 2,
        "nom": "desactiver la fusion de la mémoire dynamique",
        "description": "Par défaut, les les tables de mémoire de même taille sont autorisées à fusionner. Cette possibilité expose à la faille heap overflow",
        "categorie":"automatisée"
    },
    {
        "id": 8.5,
        "niveau": 2,
        "categorie":"automatisée",
        "nom": "Actver le renforcement de la mémoire dynamique",
        "description": "Dans la continuité de la recommandation 8.4, il est important d'activer les tests de cohérence des métadonnées, l'ajout de la zone rouge sur chaque objet et le poisonning des objets et du padding"
    },
    {
        "id": 8.6,
        "niveau": 2,
        "categorie":"automatisée",
        "nom": "Activer les contremesures spectre V4 (speculative store bypass)",
        "description": "De nombreux processeurs intels disposent d'un défaut dans leur architecture permettant l'exploitation de la faille spectre V2, qui utilise l'execution spéculative à de mauvaises fins"
    },
    {
        "id": 8.7,
        "niveau":2,
        "categorie":"automatisée",
        "nom":"Activer les contremesures spectre V2 (branch target injection)",
        "description": "De nombreux processeurs intels disposent d'un défaut dans leur architecture permettant l'exploitation de la faille spectre V2, qui utilise l'execution spéculative à de mauvaises fins"
    },
    {
        "id": 8.8,
        "niveau": 2,
        "categorie": "automatisée", 
        "nom" : "Force l'utilisation du microarchitectural data sampling",
        "description": "Le MDS est une contremesure vis-a-vis de plusieurs failles dans l'architecture des processeurs intel"
    }

]